In [2]:
import pandas as pd
import numpy as np
 
# Sukuriame pavyzdinį duomenų rinkinį
duomenys = {
    'Vardas': ['Jonas', 'Ona', 'Petras', 'Ieva'],
    'Amžius': [25, 30, 45, 22],
    'Miestas': ['Vilnius', 'Kaunas', 'Klaipėda', 'Šiauliai'],
    'Pajamos': [1500, 2200, 1800, 1600]
}
 
df = pd.DataFrame(duomenys)
df

   Vardas  Amžius   Miestas  Pajamos
0   Jonas      25   Vilnius     1500
1     Ona      30    Kaunas     2200
2  Petras      45  Klaipėda     1800
3    Ieva      22  Šiauliai     1600

In [4]:
import pandas as pd
import numpy as np
 
# Pavyzdiniai pardavimų duomenys
data = {
    "order_id": [1001, 1002, 1003, 1004, 1004],  # 1004 pasikartoja (duplicate row)
    "order_date": ["2025-01-05", "2025-01-06", "2025-01-07", "2025-01-07", "2025-01-07"],
    "customer": ["Asta", "Tomas", "Asta", "Milda", "Milda"],
    "product": ["Coffee", "Tea", "Tea", "Coffee", "Coffee"],
    "qty": [2, 1, np.nan, 3, 3],                  # qty turi trūkstamą reikšmę
    "unit_price": [3.50, 2.00, 2.00, 3.50, 3.50],
    "channel": ["Online", "Direct", "Online", "Online", "Online"],
    "discount_pct": [0.0, 0.1, 0.0, None, None]   # discount_pct turi None (missing)
}
 
df = pd.DataFrame(data)
df

,order_id,order_date,customer,product,qty,unit_price,channel,discount_pct
0,1001,2025-01-05,Asta,Coffee,2.0,3.5,Online,0.0
1,1002,2025-01-06,Tomas,Tea,1.0,2.0,Direct,0.1
2,1003,2025-01-07,Asta,Tea,NaN,2.0,Online,0.0
3,1004,2025-01-07,Milda,Coffee,3.0,3.5,Online,NaN
4,1004,2025-01-07,Milda,Coffee,3.0,3.5,Online,NaN

In [5]:
df.head(3)

,order_id,order_date,customer,product,qty,unit_price,channel,discount_pct
0,1001,2025-01-05,Asta,Coffee,2.0,3.5,Online,0.0
1,1002,2025-01-06,Tomas,Tea,1.0,2.0,Direct,0.1
2,1003,2025-01-07,Asta,Tea,NaN,2.0,Online,0.0

In [6]:
df.shape

(5, 8)

In [7]:
df.columns

Index(['order_id', 'order_date', 'customer', 'product', 'qty', 'unit_price',
       'channel', 'discount_pct'],
      dtype='str')

In [10]:
df.info

<bound method DataFrame.info of    order_id  order_date customer product  qty  unit_price channel  \
0      1001  2025-01-05     Asta  Coffee  2.0         3.5  Online
1      1002  2025-01-06    Tomas     Tea  1.0         2.0  Direct
2      1003  2025-01-07     Asta     Tea  NaN         2.0  Online
3      1004  2025-01-07    Milda  Coffee  3.0         3.5  Online
4      1004  2025-01-07    Milda  Coffee  3.0         3.5  Online

   discount_pct
0           0.0
1           0.1
2           0.0
3           NaN
4           NaN  >

In [11]:
df.sample()

,order_id,order_date,customer,product,qty,unit_price,channel,discount_pct
1,1002,2025-01-06,Tomas,Tea,1.0,2.0,Direct,0.1